InformationRegisters/ExchangeTransportSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<InformationRegister>
		<Properties>
			<Name>ExchangeTransportSettings</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>COMAuthenticationOS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMInfobaseOperationMode</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMInfobaseNameAtServer1CEnterprise</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMUserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMServerName1CEnterprise</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMInfobaseDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>COMUserPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILMaximumValidMessageSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILCompressOutgoingMessageFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EMAILAccount</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EmailAccounts</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILEInformationExchangeDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILECompressOutgoingMessageFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPCompressOutgoingMessageFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionMaximumValidMessageSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPassiveConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionUser</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPort</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSURLWebService</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSRememberPassword</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSUserName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>165</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSUseLargeDataTransfer</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>WSPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeMessageTransportKindByDefault</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeMessagesTransportKinds</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DataExportTransactionItemCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DataImportTransactionItemCount</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ExchangeMessageArchivePassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Node</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ExchangeMessagesTransportKinds.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>ExchangeMessagesTransportKinds</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

WebServices/MessageExchange/Ext/Module.bsl
#Region ServiceProceduresAndFunctions

////////////////////////////////////////////////////////////////////////////////
// Operation handlers

// Corresponds to operation DeliverMessages.
Function DeliverMessages(SenderCode, StreamStorage)
	
	SetPrivilegedMode(True);
	
	// Get a reference to the sender.
	Sender = ExchangePlans.MessageExchange.FindByCode(SenderCode);
	
	If Sender.IsEmpty() Then
		
		Raise NStr("en='Incorrect settings of connection to the end point have been specified.';ru='Заданы неправильные настройки подключения к конечной точке.'");
		
	EndIf;
	
	ImportedMessages = Undefined;
	DataReadInPart = False;
	
	// Importing messages into the infobase.
	MessageExchangeInternal.SerializeDataFromStream(
		Sender,
		StreamStorage.Get(),
		ImportedMessages,
		DataReadInPart);
	
	// Processing the queue of messages.
	If CommonUse.FileInfobase() Then
		
		MessageExchangeInternal.ProcessSystemMessageQueue(ImportedMessages);
		
	Else
		
		BackgroundJobParameters = New Array;
		BackgroundJobParameters.Add(ImportedMessages);
		
		BackgroundJobs.Execute("MessageExchangeInternal.ProcessSystemMessageQueue", BackgroundJobParameters);
		
	EndIf;
	
	If DataReadInPart Then
		
		Raise NStr("en='Error occurred when delivering quick messages
		|- some messages were not delivered due to specified data area locks!
		|
		|These messages will be processed within the messages processing queue of the system.';ru='Произошла ошибка при доставке быстрых сообщений - некоторые сообщения
		|не были доставлены из-за установленных блокировок областей данных!
		|
		|Эти сообщения будут обработаны в рамках очереди обработки сообщений системы'");
		
	EndIf;
	
EndFunction

// Corresponds to operation DeliverMessages.
Function GetInfobaseParameters(ThisEndPointDescription)
	
	SetPrivilegedMode(True);
	
	If IsBlankString(MessageExchangeInternal.ThisNodeCode()) Then
		
		ThisNodeObject = MessageExchangeInternal.ThisNode().GetObject();
		ThisNodeObject.Code = String(New UUID());
		ThisNodeObject.Description = ?(IsBlankString(ThisEndPointDescription),
									MessageExchangeInternal.ThisNodeDefaultDescription(),
									ThisEndPointDescription);
		ThisNodeObject.Write();
		
	ElsIf IsBlankString(MessageExchangeInternal.ThisNodeDescription()) Then
		
		ThisNodeObject = MessageExchangeInternal.ThisNode().GetObject();
		ThisNodeObject.Description = ?(IsBlankString(ThisEndPointDescription),
									MessageExchangeInternal.ThisNodeDefaultDescription(),
									ThisEndPointDescription);
		ThisNodeObject.Write();
		
	EndIf;
	
	ThisPointParameters = CommonUse.ObjectAttributesValues(MessageExchangeInternal.ThisNode(), "Code, description");
	
	Result = New Structure;
	Result.Insert("Code",          ThisPointParameters.Code);
	Result.Insert("Description", ThisPointParameters.Description);
	
	Return ValueToStringInternal(Result);
EndFunction

// Corresponds to operation ConnectEndPoint.
Function ToConnectEndPoint(Code, Description, RecipientConnectionSettingsString)
	
	Cancel = False;
	
	MessageExchangeInternal.ConnectEndPointAtRecipient(Cancel, Code, Description, ValueFromStringInternal(RecipientConnectionSettingsString));
	
	Return Not Cancel;
EndFunction

// Corresponds to operation UpdateConnectionSettings.
Function RefreshConnectionSettings(Code, ConnectionSettingsString)
	
	ConnectionSettings = ValueFromStringInternal(ConnectionSettingsString);
	
	SetPrivilegedMode(True);
	
	EndPoint = ExchangePlans.MessageExchange.FindByCode(Code);
	If EndPoint.IsEmpty() Then
		Raise NStr("en='Incorrect settings of connection to the end point have been specified.';ru='Заданы неправильные настройки подключения к конечной точке.'");
	EndIf;
	
	BeginTransaction();
	Try
		
		// Update the connection settings.
		RecordStructure = New Structure;
		RecordStructure.Insert("Node", EndPoint);
		RecordStructure.Insert("ExchangeMessageTransportKindByDefault", Enums.ExchangeMessagesTransportKinds.WS);
		
		RecordStructure.Insert("WSURLWebService",   ConnectionSettings.WSURLWebService);
		RecordStructure.Insert("WSUserName", ConnectionSettings.WSUserName);
		RecordStructure.Insert("WSPassword",          ConnectionSettings.WSPassword);
		RecordStructure.Insert("WSRememberPassword", True);
		
		// add record to the information register
		InformationRegisters.ExchangeTransportSettings.UpdateRecord(RecordStructure);
		
		CommitTransaction();
	Except
		RollbackTransaction();
		Raise;
	EndTry;
	
EndFunction

// Corresponds to operation SetLeadingEndPoint.
Function SetLeadingEndPoint(ThisEndPointCode, LeadingEndPointCode)
	
	MessageExchangeInternal.SetLeadingEndPointAtRecipient(ThisEndPointCode, LeadingEndPointCode);
	
EndFunction

// Corresponds to operation TestConnectionRecipient.
Function CheckConnectionAtRecipient(ConnectionSettingsString, SenderCode)
	
	SetPrivilegedMode(True);
	
	ErrorMessageString = "";
	
	WSProxy = MessageExchangeInternal.GetWSProxy(ValueFromStringInternal(ConnectionSettingsString), ErrorMessageString);
	
	If WSProxy = Undefined Then
		Raise ErrorMessageString;
	EndIf;
	
	WSProxy.CheckConnectionAtSender(SenderCode);
	
EndFunction

// Corresponds to operation TestConnectionSender.
Function CheckConnectionAtSender(SenderCode)
	
	SetPrivilegedMode(True);
	
	If MessageExchangeInternal.ThisNodeCode() <> SenderCode Then
		
		Raise NStr("en='Receiver base connection settings indicate the another sender.';ru='Настройки подключения базы получателя указывают на другого отправителя.'");
		
	EndIf;
	
EndFunction

#EndRegion
